app/models/user.rb

    def reset_session_token
        self.session_token = self.class.generate_session_token
        self.save!
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6NxmGs3QP5BICSUl_O0B0A"], ["updated_at", "2019-10-02 01:06:22.561673"], ["id", 3]]